rpi5-32/20240730-1249-glibc-default/logs/pgbench-no-128-1000-1000/pgbench-warmup-1-1000.log
pgbench (18devel)
transaction type: <builtin: select only>
scaling factor: 1
partition method: range
partitions: 1000
query mode: prepared
number of clients: 32
number of threads: 32
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 161319
number of failed transactions: 0 (0.000%)
latency average = 1.984 ms
initial connection time = 31.792 ms
tps = 16127.816437 (without initial connection time)